## 날짜

- 날짜, 시간 클래스
   - datetime 은 파이썬 설치 시 기본적으로 내장된 라이브러리
        - 날짜, 시간, 날짜 시간 등 쓰임새에 따라 클래스가 분화되어 있음
        - 날짜: date클래스
        - 날짜 시간: datetime클래스
    - datetime64는 numpy라이브러리에서 정의한 날짜시간 클래스
    - Timestamp는 pandas  라이브러리에서 정의한 날짜시간 클래스
        - numpy, pandas 라이브러리는 한 클래스로 날짜, 시간, 날짜 시간을 모두 정의할 수 있음
- 날짜의 기간, 시간 차이를 표시
    - timedelta

#### 파이썬의 날짜, 시간

##### - timestamp-> str

In [2]:
import time
t=time.time()
print(t, type(t))   #1970년 1월 1일부터 초를 센 것

1656564693.1127126 <class 'float'>

In [3]:
s=str(t)
print(s, type(s))

1656564693.1127126 <class 'str'>

##### - timestamp-> datetime

In [35]:
t=time.time()
print(t,type(t))

1656565741.5549035 <class 'float'>

In [37]:
from datetime import datetime

d=datetime.fromtimestamp(t)
print(d,type)

2022-06-30 14:09:01.554904 <class 'datetime.datetime'>

##### - datetime -> str

In [7]:
from datetime import datetime 

d=datetime.now()
print(d,type(d))

2022-06-30 13:53:16.882256 <class 'datetime.datetime'>

In [15]:
ds=d.strftime('%Y-%m-%d %H:%M:%S')    #데이터타임 타입의 변수를 바꾸고 싶은 문자형으로 변환
print(ds, type(ds))

2022-06-30 13:53:16 <class 'str'>

##### - str -> datetime

In [22]:
s1='2009-11-16'
print(s1, type(s1))

2009-11-16 <class 'str'>

In [23]:
sd=datetime.strptime(s1,'%Y-%m-%d')    #문자 타입의 변수와 문자의 날짜 포맷 입력 후 데이터타임으로 변환
print(sd,type(sd))

2009-11-16 00:00:00 <class 'datetime.datetime'>

##### - str-> datetime -> timestamp

In [25]:
from datetime import datetime
import time

In [26]:
s='2022-07-01 11:13:58'
print(s, type(s))

2022-07-01 11:13:58 <class 'str'>

In [27]:
d=datetime.strptime(s,'%Y-%m-%d %H:%M:%S')
print(d,type(d))

2022-07-01 11:13:58 <class 'datetime.datetime'>

In [31]:
t=time.mktime(d.timetuple())
print(t,type(t))

1656641638.0 <class 'float'>

In [34]:
###timetuple에 대해
today=datetime.today()
print(today)

print(today.timetuple())   #연,월,일,시,분,초,요일,연초~현재 기간 등을 보여줌

2022-06-30 14:07:00.374032

time.struct_time(tm_year=2022, tm_mon=6, tm_mday=30, tm_hour=14, tm_min=7, tm_sec=0, tm_wday=3, tm_yday=181, tm_isdst=-1)

#### 파이썬의 timedelta

##### - 1년전 datetime 값 구하기

In [46]:
from datetime import datetime, timedelta

now=datetime.now()
days=timedelta(days=-365)

one_year_ago=now+days
print(one_year_ago)

2021-06-30 14:38:40.096644

##### - 두 날짜 간 일 수 구하기

In [48]:
#날짜 지정하기
since=datetime.strptime('19951116','%Y%m%d')
until=datetime.strptime('06/30/2022','%m/%d/%Y')

In [59]:
#날짜 간격 구하기
birth_day=until-since
print(birth_day)

print(birth_day.days)

9723 days, 0:00:00
9723

##### - 특정 요일 구하기

In [70]:
import datetime

#방법1
def get_yoil_(y,m,d):
    w=datetime.date(y,m,d).weekday()
    days=['Mon','Tue','Wed','Thur','Fri','Sat','Sun']
    return days[w]

In [71]:
get_yoil_(2022,6,30)

'Thur'

In [73]:
from datetime import datetime

#방법2: 굳이 안써도되는..
def get_yoil(y,m,d):
    w=datetime.strptime(str(y)+str(m)+str(d),'%Y%m%d').weekday()
    days=['Mon','Tue','Wed','Thur','Fri','Sat','Sun']
    return days[w]

In [74]:
get_yoil(2022,6,30)

'Thur'

#### 판다스의 날짜
##### *주의: 판다스의 timestamp= 파이썬의 datetime

In [76]:
import pandas as pd
import numpy

##### to_datetime,  Timestamp
##### - 파이썬의 timestamp -> 판다스의 timestamp

In [88]:
pd.to_datetime(time.time(), unit='s')    #1970년 1월 1일부터  초 단위로 계산

Timestamp('2022-06-30 06:05:29.163765504')

In [90]:
pd.Timestamp(time.time(),unit='s',tz='Asia/Seoul')  #타임 존을 서울시로 지정

Timestamp('2022-06-30 15:07:31.885098696+0900', tz='Asia/Seoul')

#### 일정 기간 내 동일 간격의 날짜 출력

##### date_range

In [160]:
pd.date_range('2018-06-30','2022-06-30', periods=10)       #동일 간격으로 10개 날짜 출력됨

DatetimeIndex(['2018-06-30 00:00:00', '2018-12-09 08:00:00',
               '2019-05-20 16:00:00', '2019-10-30 00:00:00',
               '2020-04-09 08:00:00', '2020-09-18 16:00:00',
               '2021-02-28 00:00:00', '2021-08-09 08:00:00',
               '2022-01-18 16:00:00', '2022-06-30 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [167]:
pd.date_range('2022-06-28',periods=10, freq='1h')     #지정 날짜부터 freq 간격대로 preiods개 뽑아내라

DatetimeIndex(['2022-06-28 00:00:00', '2022-06-28 01:00:00',
               '2022-06-28 02:00:00', '2022-06-28 03:00:00',
               '2022-06-28 04:00:00', '2022-06-28 05:00:00',
               '2022-06-28 06:00:00', '2022-06-28 07:00:00',
               '2022-06-28 08:00:00', '2022-06-28 09:00:00'],
              dtype='datetime64[ns]', freq='H')

In [165]:
pd.date_range('2022-06-28 23:59','2022-06-30 21:00',freq='4h')   #4시간 간격으로 출력됨

DatetimeIndex(['2022-06-28 23:59:00', '2022-06-29 03:59:00',
               '2022-06-29 07:59:00', '2022-06-29 11:59:00',
               '2022-06-29 15:59:00', '2022-06-29 19:59:00',
               '2022-06-29 23:59:00', '2022-06-30 03:59:00',
               '2022-06-30 07:59:00', '2022-06-30 11:59:00',
               '2022-06-30 15:59:00', '2022-06-30 19:59:00'],
              dtype='datetime64[ns]', freq='4H')

#### stock-data파일로 실습

In [133]:
import os
os.getcwd()
os.chdir('C:\cakd7\m2_분석라이브러리활용\pandas\dataset')

In [143]:
#파일 불러오기
import pandas as pd

df=pd.read_csv('stock-data.csv')
df.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [144]:
#데이터 살펴보기
df.info()    #Date가 문자로 되어 있음

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [145]:
#Date컬럼을 날짜형태로 변환하여 새로운 컬럼 생성

df['n_Date']=pd.to_datetime(df['Date'])
df.head()

         Date  Close  Start   High    Low  Volume     n_Date
0  2018-07-02  10100  10850  10900  10000  137977 2018-07-02
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29
2  2018-06-28  10400  10900  10950  10150  155769 2018-06-28
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27
4  2018-06-26  10800  10900  11000  10700   63039 2018-06-26

In [146]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
 6   n_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB

In [147]:
#Date 컬럼 삭제

df.drop('Date', axis=1,inplace=True)
df.head()

   Close  Start   High    Low  Volume     n_Date
0  10100  10850  10900  10000  137977 2018-07-02
1  10700  10550  10900   9990  170253 2018-06-29
2  10400  10900  10950  10150  155769 2018-06-28
3  10900  10800  11050  10500  133548 2018-06-27
4  10800  10900  11000  10700   63039 2018-06-26

In [148]:
#연도, 월, 일  컬럼 생성
df['year']=df.n_Date.dt.year
df['month']=df['n_Date'].dt.month
df['day']=df['n_Date'].dt.day
df.head()

   Close  Start   High    Low  Volume     n_Date  year  month  day
0  10100  10850  10900  10000  137977 2018-07-02  2018      7    2
1  10700  10550  10900   9990  170253 2018-06-29  2018      6   29
2  10400  10900  10950  10150  155769 2018-06-28  2018      6   28
3  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  10800  10900  11000  10700   63039 2018-06-26  2018      6   26

In [149]:
#n_Date를 인덱스로 지정
df.set_index('n_Date',inplace=True)

In [150]:
df.head()

            Close  Start   High    Low  Volume  year  month  day
n_Date
2018-07-02  10100  10850  10900  10000  137977  2018      7    2
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [151]:
#데이터프레임의 인덱스 요소 살펴보기
df.index

DatetimeIndex(['2018-07-02', '2018-06-29', '2018-06-28', '2018-06-27',
               '2018-06-26', '2018-06-25', '2018-06-22', '2018-06-21',
               '2018-06-20', '2018-06-19', '2018-06-18', '2018-06-15',
               '2018-06-14', '2018-06-12', '2018-06-11', '2018-06-08',
               '2018-06-07', '2018-06-05', '2018-06-04', '2018-06-01'],
              dtype='datetime64[ns]', name='n_Date', freq=None)

In [154]:
#조건 출력
df.loc['2018-07','Close':'Low']     #인덱스

            Close  Start   High    Low
n_Date
2018-07-02  10100  10850  10900  10000

In [ ]:
os.chdir('C:\cakd7\복습')

## 과제

#### 1.현재 시간을 timestamp로 불러와서 datetime, str로 타입 변경 후, 다시 timestamp로 변경

In [101]:
#현재 시간을 timestamp으로 불러오기
import time

now=time.time()
print(time, type(time))

<module 'time' (built-in)> <class 'module'>

In [106]:
#1_1. datetime으로 변환
from datetime import datetime

d_now=datetime.fromtimestamp(now)
print(d_now,type(d_now))

2022-06-30 14:13:58.818978 <class 'datetime.datetime'>

In [107]:
#1_2. str로 변환

s_now=str(now)
print(s_now, type(s_now))

1656566038.8189776 <class 'str'>

In [110]:
#2_1. 다시 timestamp로 변환

now_dt=time.mktime(d_now.timetuple())
print(now_dt,type(now_dt))

1656566038.0 <class 'float'>

In [121]:
#2_2. 다시 timestamp로 변환

now_st=float(s_now)
print(now_st, type(now_st))

1656566038.8189776 <class 'float'>

#### 2. 원하는 날짜+시간을 5개 str로 만든 후 datetime, timestamp 타입으로 변경

In [189]:
import pandas as pd
import time
from datetime import datetime

In [184]:
#5개의 날짜 생성
five_date=pd.date_range('2022-06-10',periods=5,freq='2d')

In [185]:
#판다스 timestamp를 str로 변환

s_five_date=[]
for i in five_date:
    s=str(i)
    s_five_date.append(s)
    print(s, type(s))

2022-06-10 00:00:00 <class 'str'>
2022-06-12 00:00:00 <class 'str'>
2022-06-14 00:00:00 <class 'str'>
2022-06-16 00:00:00 <class 'str'>
2022-06-18 00:00:00 <class 'str'>

In [192]:
#str을 datetime으로 변환

d_five_date=[]
for i in s_five_date:
    d=datetime.strptime(i,'%Y-%m-%d %H:%M:%S')
    d_five_date.append(d)
    print(d)

2022-06-10 00:00:00
2022-06-12 00:00:00
2022-06-14 00:00:00
2022-06-16 00:00:00
2022-06-18 00:00:00

In [195]:
#str을 timestamp 타입으로 변경

t_five_date=[]
for i in s_five_date:
    t=time.mktime(datetime.strptime(i,'%Y-%m-%d %H:%M:%S').timetuple())
    t_five_date.append(t)
    print(t)

1654786800.0
1654959600.0
1655132400.0
1655305200.0
1655478000.0